app/controllers/users_controller.rb

  def update
    @user  = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "name" = 'Masha L', "password_digest" = '$2a$10$UEDSzsc.NskNzn0Al.j7c.5FbcsRnew7eihM835Op5nGK/d7bdFfe', "remember_token" = 'g-5_vcZaNMfXJ9IqyH07ng', "updated_at" = '2014-12-30 21:59:59.593152' WHERE "users"."id" = 1

  def show
      @user = User.find(params[:id])
      @microposts = @user.microposts.paginate(page: params[:page])
---
SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = 1 ORDER BY microposts.created_at DESC LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = 1